// API для роботи з нотатками
// ==========================================================================================
// Функції для виконання HTTP-запитів
// ==========================================================================================

// lib/api/api.ts — для створення одного спільного екземпляра axios,
// з налаштуванням withCredentials: true для підтримки cookies;
// ==========================================================================================

// Імпорт бібліотеки axios
import axios from 'axios';

// Створюємо інстанс axios
export const nextServer = axios.create({
  // Базова URL-адреса для всіх запитів, що надсилаються через цей інстанс
  baseURL: process.env.NEXT_PUBLIC_API_URL + '/api',
  // Налаштування, що дозволяє axios працювати з cookie,
  // що необхідно для автентифікації та збереження сесій
  withCredentials: true,
});
