// ==========================================================================================
// Інтерфейс для типізації інгредієнта
// ==========================================================================================
//   "_id": "686f6e9ac1d1a4f95c0ea311",
//   "name": "Tomato",
//   "desc": "Fresh red tomato",
//   "img": "https://example.com/images/tomato.png"

// ==========================================================================================
export interface Ingredient {
  name: string;
  desc: string;
  img: string;
}
