// ==========================================================================================
// Інтерфейс для типізації користувача
// ==========================================================================================
// id: '65ca67e7ae7f10c88b598384';
// title: 'Sample Note';
// content: 'This is a sample note content.';
// createdAt: '2022-01-01T00:00:00Z';
// updatedAt: '2022-01-01T00:00:00Z';
// tag: 'Todo';
// ==========================================================================================
export interface User {
  email: string;
  username: string;
  avatar: string;
}
