'use client';

// ==========================================================================================
// Відображається тільки якщо є наступна сторінка (hasNextPage)
// Під час завантаження - кнопка задизейблена
// ==========================================================================================

// Імпорт стилів
import css from './LoadMoreBtn.module.css';

// ==========================================================================================
// Типізація пропсів
// ==========================================================================================
interface LoadMoreBtnProps {
  onClick: () => void;
  isLoading: boolean;
}

// ==========================================================================================
// Компонент
// ==========================================================================================
const LoadMoreBtn = ({ onClick, isLoading }: LoadMoreBtnProps) => {
  return (
    <div className={css.wrapper}>
      <button className={css.button} onClick={onClick} disabled={isLoading} type="button">
        {isLoading ? 'Loading...' : 'Load more'}
      </button>
    </div>
  );
};

export default LoadMoreBtn;
